/*
- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
    Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
*/

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length >= 3) {
    console.log("великий масив, в якому  3 і більше елементи");
} else {
    console.log("маленький масив, в якому менше 3-х елементів");
}

/*
- Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
    Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.*/

let a = 1, b = 50, c = 33;
if (a > b && a < c) {
    console.log("а посередині");
} else if (b > a && b < c) {
    console.log("b посередині");
} else console.log("c посередині");

/*- Перепишіть конструкцію if з використанням умовного оператора '?':
let result;
if (a + b < 4) {
    result = 'Мало';
} else {
    result = 'Багато';
}*/

let result, a1 = 1, b1 = 1;
console.log(a1 + b1 < 4 ? result = 'Мало' : result = 'Багато');

/*
- Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
напишіть це тернарним оператором
*/

let someNumber = 2;
someNumber < 0 ? console.log("Negative number") : someNumber > 0 ? console.log("Positive number") : console.log("number is zero");


