/*
 Користувач вводить або має два числа.
    Потрібно знайти та вивести максимальне число з тих двох .
    Також потрібно врахувати коли введені рівні числа.*/

let a = 10;
let b = 321;

if (a < b) {
    console.log(b);
} else {
    console.log(a);
}

/*
- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
Користувач вводить номер квартири просто в змінні або через prompt('') .
    Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
*/
let flatNumber = 21;
if (flatNumber <= 20 && flatNumber > 0) {
    console.log("Перший підїзд");
} else if (flatNumber > 20 && flatNumber <= 48) {
    console.log("Другий підїзд");
} else if (flatNumber > 48 && flatNumber <= 90) {
    console.log("Третій підїзд");
}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number = 1;
if (number === 10) {
    console.log("Вірно")
} else console.log("Невірно");

/*
- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
    якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
якщо в змінну записали щось інше, спрацьовує else*/

let x="123";

if (typeof (x) === 'number' || typeof (x) === 'string' || typeof (x) === 'object' || typeof (x) === 'boolean') {
    if (typeof (x) === 'number') {
        console.log(1);
    } else if (typeof (x) === 'string') {
        console.log(2);
    } else if (typeof (x) === 'boolean') {
        console.log(3);
    } else if (typeof (x) === 'object') {
        console.log(4)
    }
} else console.log("Error");

/*- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
    Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН*/

let temp = 22;
if (temp >= 10 && temp <= 22) {
    console.log("ми йдемо ВЧИТИСЯ");
} else console.log("сидимо вдома і вчимося ОНЛАЙН");

/*- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
    числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .*/

let prise = 6;

switch (prise) {
    case 1:
        console.log("Авто");
        break;
    case 2:
        console.log("Мото");
        break;
    case 3:
        console.log("Телефон");
        break;
    case 4:
        console.log("Літак");
        break;
    case 5:
        console.log("Стіл");
        break;
    default:
        console.log("Incorrect number");
        break;
}















