// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let a = 50;
if (a <= 15) {
    console.log("Перша чверть години")
} else if (a > 15 && a <= 30) {
    console.log("Друга чверть години")
} else if (a > 30 && a <= 45) {
    console.log("Третя чверть години")
} else {
    console.log("Четверта чверть години")
}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day = 25;

if (day <= 10) {
    console.log("Перша декада");
} else if (day > 10 && day <= 20) {
    console.log("Друга декада");
} else {
    console.log("Третя декада");
}

//- У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//    Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = true;
if (test !== true) {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}
// з коротким записом(тернаркою)
let test2 = test !== true ? 'Вірно' : 'Неправильно';
console.log(test2);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
let a3 = 1;
if (a3 !== 0) {
    console.log('Вірно')
} else {
    console.log('НеВірно')
}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
let week_day = +prompt("Введіть номер дня: ");
switch (week_day) {
    case 1:
        console.log("Помити автомобіль");
        break;
    case 2:
        console.log("Сходити на роботу");
        break;
    case 3:
        console.log("Вигуляти собаку");
        break;
    case 4:
        console.log("Поприбирати в квартирі");
        break;
    case 5:
        console.log("Уроки англійської");
        break;
    case 6:
        console.log("Прогулянка");
        break;
    case 7:
        console.log("Скласти план на наступний тиждень");
        break;
}


// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
let year = 1984;

if (year % 4 === 0) {
    console.log("Високосний рік");
} else {
    console.log("Невисокосний рік");
}


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let jsName = prompt("Яка «офіційна» назва JavaScript?");
if (jsName === "ECMAScript") {
    console.log("Правильно!");
} else {
    console.log("Не знаєте? ECMAScript!");
}







